# HideCropBoundaries Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..HideCropBoundaries Property
PrintParameters Class See Also
---
Indicates whether to hide crop boundaries when printing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HideCropBoundaries { get; set; }
```

Visual Basic
---
```text
Public Property HideCropBoundaries As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HideCropBoundaries {
	bool get ();
	void set (bool value);
}
```

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace